Revit 2027 API
PanelScheduleData.ShowCircuitNumberOnOneRowForMultiphaseCircuits Property
 Shows the circuit number broken up on each row of the multiphase circuit rows if true, all on the first row otherwise
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool ShowCircuitNumberOnOneRowForMultiphaseCircuits { get; set; }
Public Property ShowCircuitNumberOnOneRowForMultiphaseCircuits As Boolean
	Get
	Set
public:
property bool ShowCircuitNumberOnOneRowForMultiphaseCircuits {
	bool get ();
	void set (bool value);
}
member ShowCircuitNumberOnOneRowForMultiphaseCircuits : bool with get, set
Property Value
Boolean
Remarks
 Only applicable to two column formats
See Also
Reference
PanelScheduleData Class
Autodesk.Revit.DB.Electrical Namespace